In [2]:
import pandas as pd
import pandera as pa
import numpy as np
from nptyping import NDArray, Shape, Int64

## Pandas DataFrame operations

- add new column
- - one column
- - two or more column
- delete column
- change data type of column
- map
- apply
- - on one column
- - more than one column
- concat
- - axis 
- - -  axis = 0 (top to bottom)
- - - axis = 1 (left to right)
- describe dataframe
- - `df.info()` # total index, columns names and data type, total fill cells
- - `df.describe()` # mean std, min # statistical properties | apply only numeric columns

In [18]:
total : int = 100
s1 : NDArray[Shape[str(total)],Int64] = np.random.randint(20,80,total)
s1

array([54, 52, 62, 31, 76, 20, 26, 35, 65, 50, 76, 70, 40, 75, 27, 30, 58,
       60, 76, 53, 69, 29, 45, 38, 56, 33, 66, 23, 75, 59, 22, 20, 73, 77,
       21, 60, 52, 41, 62, 78, 33, 37, 75, 55, 31, 48, 27, 60, 21, 41, 64,
       65, 26, 53, 63, 30, 72, 26, 27, 56, 22, 55, 25, 66, 32, 69, 69, 47,
       55, 65, 38, 42, 31, 20, 48, 50, 69, 72, 36, 38, 67, 71, 74, 28, 46,
       72, 24, 39, 60, 60, 36, 76, 25, 44, 45, 26, 57, 29, 31, 63])

### Create a CSV file using DataFrame

In [20]:
s1 : pd.Series = pd.Series([1,2,3,4,5],name='Student Id')
s2 : pd.Series = pd.Series([10,20,30,40,50],name='Score')
s3 : pd.Series = pd.Series(["Sarmad","Hammad",'Akmal','Fakhir','Mustansar'],name='Student Name')

df1 : pd.DataFrame = pd.DataFrame({'Student Id':s1,'Student Name':s2,'Score':s3})

df1.to_csv('student.csv',index = False)

In [57]:
total : int = 10
s1 : NDArray[Shape[str(total)+'5'],Int64] = np.random.randint(10,50,(total,5))
ss1 : pd.DataFrame = pd.DataFrame(s1,columns=list('ABCDE'))

s2 : NDArray[Shape[str(total)+'5'],Int64] = np.random.randint(50,100,(total,5))
ss2 : pd.DataFrame = pd.DataFrame(s2,columns=list('FGHIJ'))

s3 : NDArray[Shape[str(total)+'5'],Int64] = np.random.randint(100,150,(total,5))
ss3 : pd.DataFrame = pd.DataFrame(s3,columns=list('KLMNO'))

In [58]:
ss1

    A   B   C   D   E
0  21  33  25  28  41
1  17  11  27  14  38
2  43  14  43  15  30
3  14  27  12  26  44
4  24  32  46  37  22
5  18  43  38  42  26
6  44  12  21  47  38
7  31  24  38  41  23
8  33  27  40  44  37
9  14  12  37  22  10

In [22]:
ss2

    F   G   H   I   J
0  90  90  86  93  52
1  95  63  54  81  56
2  92  68  78  88  70
3  51  92  74  50  81
4  60  63  92  72  74
5  54  94  69  77  51
6  79  63  55  55  53
7  70  55  69  89  61
8  76  76  83  95  54
9  82  92  86  85  71

In [23]:
ss3

     K    L    M    N    O
0  139  117  114  116  132
1  130  138  146  125  131
2  121  110  123  126  148
3  135  109  101  118  119
4  133  109  144  144  101
5  133  106  113  133  143
6  102  108  106  135  135
7  148  117  146  107  110
8  130  142  103  139  138
9  106  142  139  126  116

## DataFrame Operations

In [25]:
df : pd.DataFrame = pd.concat([ss1])

display(df.info())
print("================================================================")
display(df.describe())
print("================================================================")
display(df.head())
print("================================================================")
display(df.tail())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int32
 1   B       10 non-null     int32
 2   C       10 non-null     int32
 3   D       10 non-null     int32
 4   E       10 non-null     int32
dtypes: int32(5)
memory usage: 332.0 bytes

None

================================================================

               A          B          C          D          E
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   27.900000  28.000000  37.500000  26.500000  33.800000
std    10.743991  13.341664   8.885069  13.769935  13.070748
min    10.000000  10.000000  20.000000  10.000000  11.000000
25%    21.000000  16.000000  33.500000  15.250000  28.500000
50%    26.000000  29.000000  40.000000  26.000000  39.000000
75%    38.500000  39.500000  43.500000  37.750000  42.000000
max    42.000000  45.000000  48.000000  44.000000  48.000000

================================================================

    A   B   C   D   E
0  25  41  44  17  42
1  41  37  45  11  26
2  21  10  32  16  40
3  21  14  38  10  43
4  41  19  40  35  38

================================================================

    A   B   C   D   E
5  27  45  40  44  12
6  31  15  26  15  36
7  10  21  20  38  48
8  42  40  48  37  42
9  20  38  42  42  11

## Reading CSV file

In [26]:
df1 : pd.DataFrame = pd.read_csv('./student.csv')

df1

   Student Id  Student Name      Score
0           1            10     Sarmad
1           2            20     Hammad
2           3            30      Akmal
3           4            40     Fakhir
4           5            50  Mustansar

## Apply operations on columns

- Extract one column from DataFrame
    - `dataframe['column']`
        - add new column to DataFrame
        - get column with space between columns text `column name`
    - `dataframe.column` 
        - cannot add column to DataFrame
        - cannot access column with text space
- Extract two or more columns from DataFrame
    - `dataframe['column1','column2']`
        - pass list into DataFrame

In [27]:
# Top to bottom
df["B"]

0    41
1    37
2    10
3    14
4    19
5    45
6    15
7    21
8    40
9    38
Name: B, dtype: int32

In [28]:
df.C

0    44
1    45
2    32
3    38
4    40
5    40
6    26
7    20
8    48
9    42
Name: C, dtype: int32

In [32]:
# Extract multiple columns
df[['A','B','C']]

    A   B   C
0  25  41  44
1  41  37  45
2  21  10  32
3  21  14  38
4  41  19  40
5  27  45  40
6  31  15  26
7  10  21  20
8  42  40  48
9  20  38  42

## Add new column

- Addition operation on column

In [37]:
# Create a new column
df['Total'] = 90
df

    A   B   C   D   E  Total
0  25  41  44  17  42     90
1  41  37  45  11  26     90
2  21  10  32  16  40     90
3  21  14  38  10  43     90
4  41  19  40  35  38     90
5  27  45  40  44  12     90
6  31  15  26  15  36     90
7  10  21  20  38  48     90
8  42  40  48  37  42     90
9  20  38  42  42  11     90

In [44]:
# Updating a Column

df['Total'] = 40
df

    A   B   C   D   E  Total
0  25  41  44  17  42     40
1  41  37  45  11  26     40
2  21  10  32  16  40     40
3  21  14  38  10  43     40
4  41  19  40  35  38     40
5  27  45  40  44  12     40
6  31  15  26  15  36     40
7  10  21  20  38  48     40
8  42  40  48  37  42     40
9  20  38  42  42  11     40

In [45]:
# Deleting a column

del df['Total']

df

    A   B   C   D   E
0  25  41  44  17  42
1  41  37  45  11  26
2  21  10  32  16  40
3  21  14  38  10  43
4  41  19  40  35  38
5  27  45  40  44  12
6  31  15  26  15  36
7  10  21  20  38  48
8  42  40  48  37  42
9  20  38  42  42  11

In [49]:
# We cannot insert update and delete a column using the . method.

df.total = 30 # Cannot create a new column
display(df)

del df.E # Cannot delete a column
display(df)

    A   B   C   D   E
0  25  41  44  17  42
1  41  37  45  11  26
2  21  10  32  16  40
3  21  14  38  10  43
4  41  19  40  35  38
5  27  45  40  44  12
6  31  15  26  15  36
7  10  21  20  38  48
8  42  40  48  37  42
9  20  38  42  42  11

AttributeError: 'DataFrame' object has no attribute 'E'

In [53]:
# Arithmetic operations on columns
display(df)

df['B'] + 12 # Adding 12 to every columns

    A   B   C   D   E
0  25  41  44  17  42
1  41  37  45  11  26
2  21  10  32  16  40
3  21  14  38  10  43
4  41  19  40  35  38
5  27  45  40  44  12
6  31  15  26  15  36
7  10  21  20  38  48
8  42  40  48  37  42
9  20  38  42  42  11

0    53
1    49
2    22
3    26
4    31
5    57
6    27
7    33
8    52
9    50
Name: B, dtype: int32

In [56]:
# Getting the total of every column

df['Total'] = df['A'] + df['B'] + df['C'] + df['D'] + df['E']
df

    A   B   C   D   E  Total
0  25  41  44  17  42    169
1  41  37  45  11  26    160
2  21  10  32  16  40    119
3  21  14  38  10  43    126
4  41  19  40  35  38    173
5  27  45  40  44  12    168
6  31  15  26  15  36    123
7  10  21  20  38  48    137
8  42  40  48  37  42    209
9  20  38  42  42  11    153

## Creating a Student Result Card Template

In [71]:

total: int = 10

scores: NDArray[Shape[str(total)+'5'],Int64] = np.random.randint(1,100,(total,5))

result_card : pd.DataFrame = pd.DataFrame(
    scores, columns=["English", "Computer", "Math", "Physics", "Islamiyat"]
)
result_card

   English  Computer  Math  Physics  Islamiyat
0       44         8    20       98         33
1       19        34    14       17         67
2       87        82    74       13          2
3       29        55    26       80         94
4       34        97    96       11         96
5       66        19    63       91         76
6       96        25    63       22         31
7       69        55     8       73         99
8        2        58    16       41         63
9       80         5    76       39         53

In [75]:
# Adding a Total and Obtained Column

result_card['Total'] = 500


result_card['Obtained'] = (
    result_card['English'] + result_card['Computer'] + result_card['Islamiyat'] + result_card['Math'] + result_card['Physics']
    )

result_card

   English  Computer  Math  Physics  Islamiyat  Total  Obtained
0       44         8    20       98         33    500       203
1       19        34    14       17         67    500       151
2       87        82    74       13          2    500       258
3       29        55    26       80         94    500       284
4       34        97    96       11         96    500       334
5       66        19    63       91         76    500       315
6       96        25    63       22         31    500       237
7       69        55     8       73         99    500       304
8        2        58    16       41         63    500       180
9       80         5    76       39         53    500       253

In [76]:
# Creating a Grade Column

result_card['Percentage'] = (result_card['Obtained'] / result_card['Total']) * 100

result_card

   English  Computer  Math  Physics  Islamiyat  Total  Obtained  Percentage
0       44         8    20       98         33    500       203        40.6
1       19        34    14       17         67    500       151        30.2
2       87        82    74       13          2    500       258        51.6
3       29        55    26       80         94    500       284        56.8
4       34        97    96       11         96    500       334        66.8
5       66        19    63       91         76    500       315        63.0
6       96        25    63       22         31    500       237        47.4
7       69        55     8       73         99    500       304        60.8
8        2        58    16       41         63    500       180        36.0
9       80         5    76       39         53    500       253        50.6

In [92]:
# Checking Grade

def grade(score:float) ->str:
    if score>80:
        return 'A+'
    elif score>=75:
        return 'B+'
    elif score>=70:
        return 'B'
    elif score>=60:
        return 'C'
    elif score>=50:
        return 'D'
    elif score>=33:
        return 'E'
    else:
        return 'F'

grade(65)

'C'

In [93]:
# Creating a Grade Column

result_card['Grade'] = result_card['Percentage'].apply(grade)

result_card

,English,Computer,Math,Physics,Islamiyat,Total,Obtained,Percentage,Grade
0,44,8,20,98,33,500,203,40.6,E
1,19,34,14,17,67,500,151,30.2,F
2,87,82,74,13,2,500,258,51.6,D
3,29,55,26,80,94,500,284,56.8,D
4,34,97,96,11,96,500,334,66.8,C
5,66,19,63,91,76,500,315,63.0,C
6,96,25,63,22,31,500,237,47.4,E
7,69,55,8,73,99,500,304,60.8,C
8,2,58,16,41,63,500,180,36.0,E
9,80,5,76,39,53,500,253,50.6,D

In [94]:
# Converting to a CSV file

result_card.to_csv("result_card.csv")